app/views/messages/index.html.erb

SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."id" = ? LIMIT 1  [["id", 8]]
SELECT "messages".* FROM "messages"  WHERE "messages"."room_id" = ?  [["room_id", 8]]
SELECT  "users".* FROM "users"  WHERE "users"."username" = 'user' LIMIT 1
---
<% Room.find(params[:chatroom_id]).messages.as_json.each do |msg| %>
	<%= msg['text'] %>
	<% if User.find_by(username: session[:user])['id'] == msg['user_id'] %>