app/views/chatrooms/index.html.erb

<br>
<% Room.all.as_json.each do |x| %>
---
SELECT "rooms".* FROM "rooms"