app/views/chatrooms/new.html.erb

<p>
<% Room.all.as_json.each_index do |index| %>
---
SELECT "rooms".* FROM "rooms"