app/controllers/chatrooms_controller.rb

  def show
  	@room = Room.find_by!(name: params[:room])
---
SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."name" = 'room2' LIMIT 1