app/controllers/chatrooms_controller.rb

	def new
		if params[:submit]
			Room.create(name: params[:name], password: params[:pass])
---
INSERT INTO "rooms" ("created_at", "name", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-30 11:59:52.371410"], ["name", "room"], ["password", "secret"], ["updated_at", "2014-10-30 11:59:52.371410"]]

  def show
  	@id = Room.find_by!(id: params[:id])
---
SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."id" = 0 LIMIT 1

  def edit
  	if params[:submit]
	  	@room = Room.find_by!(id: params[:id])
---
SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."id" = 4 LIMIT 1

  def destroy
    Room.find_by(id: params[:id]).destroy
---
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 2]]
SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."id" = 3 LIMIT 1

	def authenticate
  	if params[:room_pwd] == Room.find_by(id: params[:room])['password']
---
SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."id" IS NULL LIMIT 1