app/controllers/chatrooms_controller.rb

SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."name" = 'room' LIMIT 1
---
  def room
  	@room = Room.find_by!(name: params[:room])