app/controllers/messages_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."username" = 'pauls' LIMIT 1
SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."name" = 'room' LIMIT 1
INSERT INTO "messages" ("author", "created_at", "room", "text", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "123"], ["created_at", "2014-10-30 15:14:16.892529"], ["room", "room"], ["text", "hey"], ["updated_at", "2014-10-30 15:14:16.892529"]]
---
  def new
  	user_id = User.find_by(username: session[:user])['id']
  	room_id = Room.find_by(name: session[:room])['id']

  	Message.create(user_id: user_id, room_id: room_id, text: params[:message])