app/controllers/messages_controller.rb

DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 14]]
SELECT  "messages".* FROM "messages"  WHERE "messages"."id" = 14 LIMIT 1
---
  def destroy
    Message.find(params[:id]).destroy