app/controllers/users_controller.rb

	def index
		redirect_to '/chatrooms' if session[:user]

		if params[:password] && params[:password] == User.find_by(username: params[:username])[:password]
---
SELECT  "users".* FROM "users"  WHERE "users"."username" = 'user' LIMIT 1

  def new
  	if params[:username]
	  	user = User.create(username: params[:username], password: params[:password])
---
INSERT INTO "users" ("created_at", "password", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", "2015-07-28 08:16:08.148553"], ["password", "user"], ["updated_at", "2015-07-28 08:16:08.148553"], ["username", "user"]]